# Beginning Data Analysis

In [1]:
import pandas as pd
import numpy as np
pd.set_option('max_columns', 4, 'max_rows', 10, 'max_colwidth', 12)

### EDA :

## Introduction

## Developing a data analysis routine

### How to do it...

In [2]:
college = pd.read_csv('data/college.csv')
college.sample(random_state=42)                       # 반복에서 42의 행 또는 열을 반환

           INSTNM         CITY  ... MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
3649  Career P...  San Antonio  ...        20700           14977

[1 rows x 27 columns]

In [3]:
college.shape                                        # .shape으로 DataFrame의 차원을 알 수 있다.

(7535, 27)

In [4]:
college.info()                                       # 칼럼의 이름, 비결측치 개수, 각 칼럼의 데이터 형식과 메모리 사용량을 알 수 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   INSTNM              7535 non-null   object
 1   CITY                7535 non-null   object
 2   STABBR              7535 non-null   object
 3   HBCU                7164 non-null   float64
 4   MENONLY             7164 non-null   float64
 5   WOMENONLY           7164 non-null   float64
 6   RELAFFIL            7535 non-null   int64
 7   SATVRMID            1185 non-null   float64
 8   SATMTMID            1196 non-null   float64
 9   DISTANCEONLY        7164 non-null   float64
 10  UGDS                6874 non-null   float64
 11  UGDS_WHITE          6874 non-null   float64
 12  UGDS_BLACK          6874 non-null   float64
 13  UGDS_HISP           6874 non-null   float64
 14  UGDS_ASIAN          6874 non-null   float64
 15  UGDS_AIAN           6874 non-null   float64
 16  UGDS_NHPI           6874 non-null   float64
 17  UGDS_2MOR           6874 non-null   float64
 18  UGDS_NRA            6874 non-null   float64
 19  UGDS_UNKN           6874 non-null   float64
 20  PPTUG_EF            6853 non-null   float64
 21  CURROPER            7535 non-null   int64
 22  PCTPELL             6849 non-null   float64
 23  PCTFLOAN            6849 non-null   float64
 24  UG25ABV             6718 non-null   float64
 25  MD_EARN_WNE_P10     6413 non-null   object
 26  GRAD_DEBT_MDN_SUPP  7503 non-null   object
dtypes: float64(20), int64(2), object(5)
memory usage: 1.6+ MB

In [5]:
college.describe(include=[np.number]).T              # np.number타입의 데이터를 요약한다 - np.numver는 정수,부동소수점보다 상위 계층이다

            count        mean  ...         75%    max
HBCU       7164.0    0.014238  ...    0.000000    1.0
MENONLY    7164.0    0.009213  ...    0.000000    1.0
WOMENONLY  7164.0    0.005304  ...    0.000000    1.0
RELAFFIL   7535.0    0.190975  ...    0.000000    1.0
SATVRMID   1185.0  522.819409  ...  555.000000  765.0
...           ...         ...  ...         ...    ...
PPTUG_EF   6853.0    0.226639  ...    0.376900    1.0
CURROPER   7535.0    0.923291  ...    1.000000    1.0
PCTPELL    6849.0    0.530643  ...    0.712900    1.0
PCTFLOAN   6849.0    0.522211  ...    0.745000    1.0
UG25ABV    6718.0    0.410021  ...    0.572275    1.0

[22 rows x 8 columns]

In [6]:
college.describe(include=[np.object]).T   # np.object타입의 데이터를 요약한다  - pd.Categorical

C:\Users\goejt\AppData\Local\Temp/ipykernel_35952/3577276895.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  college.describe(include=[np.object]).T   # np.object타입의 데이터를 요약한다  - pd.Categorical

             count unique          top  freq
INSTNM        7535   7535  Alabama ...     1
CITY          7535   2514     New York    87
STABBR        7535     59           CA   773
MD_EARN_W...  6413    598  PrivacyS...   822
GRAD_DEBT...  7503   2038  PrivacyS...  1510

### How it works...

### There's more...

In [7]:
college.describe(include=[np.number],                     # descrube를 이용해서 분위수를 나눌수 있다.
   percentiles=[.01, .05, .10, .25, .5,
                .75, .9, .95, .99]).T

            count        mean  ...         99%    max
HBCU       7164.0    0.014238  ...    1.000000    1.0
MENONLY    7164.0    0.009213  ...    0.000000    1.0
WOMENONLY  7164.0    0.005304  ...    0.000000    1.0
RELAFFIL   7535.0    0.190975  ...    1.000000    1.0
SATVRMID   1185.0  522.819409  ...  730.000000  765.0
...           ...         ...  ...         ...    ...
PPTUG_EF   6853.0    0.226639  ...    0.946724    1.0
CURROPER   7535.0    0.923291  ...    1.000000    1.0
PCTPELL    6849.0    0.530643  ...    0.993908    1.0
PCTFLOAN   6849.0    0.522211  ...    0.986368    1.0
UG25ABV    6718.0    0.410021  ...    0.917383    1.0

[22 rows x 14 columns]

## Data dictionaries

In [8]:
pd.read_csv('data/college_data_dictionary.csv')     # 데이터딕셔너리는 메타데이터의 테이블

    column_name  description
0        INSTNM  Institut...
1          CITY  City Loc...
2        STABBR  State Ab...
3          HBCU  Historic...
4       MENONLY  0/1 Men ...
..          ...          ...
22      PCTPELL  Percent ...
23     PCTFLOAN  Percent ...
24      UG25ABV  Percent ...
25  MD_EARN_...  Median E...
26  GRAD_DEB...  Median d...

[27 rows x 2 columns]

## Reducing memory by changing data types

### How to do it...

In [9]:
college = pd.read_csv('data/college.csv')
different_cols = ['RELAFFIL', 'SATMTMID', 'CURROPER',           # 칼럼의 이름들
   'INSTNM', 'STABBR']
col2 = college.loc[:, different_cols]                           # col2 인덱스와 컬럼을 넣어줌
col2.head()

   RELAFFIL  SATMTMID  ...       INSTNM STABBR
0         0     420.0  ...  Alabama ...     AL
1         0     565.0  ...  Universi...     AL
2         1       NaN  ...  Amridge ...     AL
3         0     590.0  ...  Universi...     AL
4         0     430.0  ...  Alabama ...     AL

[5 rows x 5 columns]

* 인덱스는 별도로 지정하지 않으면 기본적으로 RangeIndex로 설정

In [10]:
col2.dtypes                  # 각 열의 데이터 형식

RELAFFIL      int64
SATMTMID    float64
CURROPER      int64
INSTNM       object
STABBR       object
dtype: object

* integer와 float의 데이터 형식은 64비트로 기본 설정

In [11]:
original_mem = col2.memory_usage(deep=True)       # memory_usage 메소드 : 각 열의 메모리 사용량을 바이트 단위로 반환
original_mem                                       # 각 메모리의 사용량

Index          128
RELAFFIL     60280
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

* deep=bool, 기본값은 False \
  True 인 경우 object 형식으로 된 열의 정확한 메모리양을 추출

In [12]:
col2['RELAFFIL'] = col2['RELAFFIL'].astype(np.int8)    # 'RELAFFIL'에는 0과 1값만 있어서 굳이 64비트가 필요없기에 8비트로 변환한다

In [13]:
col2.dtypes              # 'RELAFFIL'의 데이터 타입이 바뀌어 있다.

RELAFFIL       int8
SATMTMID    float64
CURROPER      int64
INSTNM       object
STABBR       object
dtype: object

In [14]:
col2[different_cols].memory_usage(deep=True)      # 'RELAFFIL'의 사용량이 줄어듬

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

In [15]:
col2.select_dtypes(include=['object']).nunique()    # 'object'의 데이터타입의 값의 개수(.nunique)를 출력

INSTNM    7535
STABBR      59
dtype: int64

In [16]:
col2['STABBR'] = col2['STABBR'].astype('category')   # 'STABBR' 값의 개수가 1% 미만이므로 데이터타입을 'category'형으로 변경한다
col2.dtypes

RELAFFIL        int8
SATMTMID     float64
CURROPER       int64
INSTNM        object
STABBR      category
dtype: object

In [17]:
new_mem = col2.memory_usage(deep=True)        # STABBR  444565   ->   STABBR  3120  줄어드는 것을 확인
new_mem

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660699
STABBR       13120
dtype: int64

In [18]:
new_mem / original_mem             # 'RELAFFIL'은 1/8(12%) 로 줄었고, 'STABBR'은 0.3프로 가까이 줄었다

Index       1.000000
RELAFFIL    0.125000
SATMTMID    1.000000
CURROPER    1.000000
INSTNM      1.000695
STABBR      0.029512
dtype: float64

### How it works...

### There's more...

In [19]:
college.loc[0, 'CURROPER'] = 10000000                            # 'CURROPER'에 10000000값을 넣고
college.loc[0, 'INSTNM'] = college.loc[0, 'INSTNM'] + 'a'        # 'INSTNM'에 'a'를 더한다
college[['CURROPER', 'INSTNM']].memory_usage(deep=True)          # 'CURROPER'은 64비트라 공간이 많아서 사용량이 그대로인데
                                                                 # 'INSTNM'은 'a'를 추가했는데 이건 왜 쪼꼼밖에 안 늘었을까.......

Index          128
CURROPER     60280
INSTNM      660700
dtype: int64

In [20]:
college['MENONLY'].dtype           # 'MENONLY'은 0과 1로 되어있지만 결측치가 있기 때문에 데이터 형식이 'float64'이다.

dtype('float64')

In [21]:
college['MENONLY'].astype(np.int8)  # nan 값 때문에 int로 데이터형식 변환이 불가능하다

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [22]:
college.assign(MENONLY=college['MENONLY'].astype('float16'),        # assign 메소드를 이용해 데이터 타입을 변경해 준다? 모르겠다
    RELAFFIL=college['RELAFFIL'].astype('int8'))

           INSTNM         CITY  ... MD_EARN_WNE_P10  GRAD_DEBT_MDN_SUPP
0     Alabama ...       Normal  ...        30300           33888
1     Universi...   Birmingham  ...        39700         21941.5
2     Amridge ...   Montgomery  ...        40100           23370
3     Universi...   Huntsville  ...        45500           24097
4     Alabama ...   Montgomery  ...        26600         33118.5
...           ...          ...  ...          ...             ...
7530  SAE Inst...   Emeryville  ...          NaN            9500
7531  Rasmusse...  Overland...  ...          NaN           21163
7532  National...  Highland...  ...          NaN            6333
7533  Bay Area...     San Jose  ...          NaN     PrivacyS...
7534  Excel Le...  San Antonio  ...          NaN           12125

[7535 rows x 27 columns]

In [23]:
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   INSTNM              7535 non-null   object
 1   CITY                7535 non-null   object
 2   STABBR              7535 non-null   object
 3   HBCU                7164 non-null   float64
 4   MENONLY             7164 non-null   float64
 5   WOMENONLY           7164 non-null   float64
 6   RELAFFIL            7535 non-null   int64
 7   SATVRMID            1185 non-null   float64
 8   SATMTMID            1196 non-null   float64
 9   DISTANCEONLY        7164 non-null   float64
 10  UGDS                6874 non-null   float64
 11  UGDS_WHITE          6874 non-null   float64
 12  UGDS_BLACK          6874 non-null   float64
 13  UGDS_HISP           6874 non-null   float64
 14  UGDS_ASIAN          6874 non-null   float64
 15  UGDS_AIAN           6874 non-null   float64
 16  UGDS_NHPI           6874 non-null   float64
 17  UGDS_2MOR           6874 non-null   float64
 18  UGDS_NRA            6874 non-null   float64
 19  UGDS_UNKN           6874 non-null   float64
 20  PPTUG_EF            6853 non-null   float64
 21  CURROPER            7535 non-null   int64
 22  PCTPELL             6849 non-null   float64
 23  PCTFLOAN            6849 non-null   float64
 24  UG25ABV             6718 non-null   float64
 25  MD_EARN_WNE_P10     6413 non-null   object
 26  GRAD_DEBT_MDN_SUPP  7503 non-null   object
dtypes: float64(20), int64(2), object(5)
memory usage: 1.6+ MB

In [24]:
college.index = pd.Int64Index(college.index)
college.index.memory_usage() # previously was just 80 .....거짓말        # RangeIndex와 Int64Index의 차이

60280

## Selecting the smallest of the largest

### How to do it...

In [25]:
movie = pd.read_csv('data/movie.csv')                            # movie 데이터셋을 읽는다
movie2 = movie[['movie_title', 'imdb_score', 'budget']]          # movie2의 칼럼을 정한다
movie2.head()

   movie_title  imdb_score       budget
0       Avatar         7.9  237000000.0
1  Pirates ...         7.1  300000000.0
2      Spectre         6.8  245000000.0
3  The Dark...         8.5  250000000.0
4  Star War...         7.1          NaN

In [26]:
movie2.nlargest(100, 'imdb_score').head()                       # 'nlargest'메서드로 'imdb_score'기준의 상위 100개를 선택

      movie_title  imdb_score      budget
2725  Towering...         9.5         NaN
1920  The Shaw...         9.3  25000000.0
3402  The Godf...         9.2   6000000.0
2779      Dekalog         9.1         NaN
4312  Kickboxe...         9.1  17000000.0

In [27]:
(movie2
  .nlargest(100, 'imdb_score')                                  # 'nlargest'메서드로 'imdb_score'기준의 상위 100개를 선택하고
  .nsmallest(5, 'budget')                                       #  그중에 'nsmallest'메서드로 'budget'기준의 하위 5개 선택
)                                                               #  nlargest/nsmallest(반환할 행 개수, columns이름)

      movie_title  imdb_score    budget
4804  Butterfl...         8.7  180000.0
4801  Children...         8.5  180000.0
4706  12 Angry...         8.9  350000.0
4550  A Separa...         8.4  500000.0
4636  The Othe...         8.4  500000.0

### How it works...

### There's more...

## Selecting the largest of each group by sorting

### How to do it...

In [28]:
movie = pd.read_csv('data/movie.csv')
movie[['movie_title', 'title_year', 'imdb_score']]                   # movie의 중요한 열만 데이터셋으로 잡는다

      movie_title  title_year  imdb_score
0          Avatar      2009.0         7.9
1     Pirates ...      2007.0         7.1
2         Spectre      2015.0         6.8
3     The Dark...      2012.0         8.5
4     Star War...         NaN         7.1
...           ...         ...         ...
4911  Signed S...      2013.0         7.7
4912  The Foll...         NaN         7.5
4913  A Plague...      2013.0         6.3
4914  Shanghai...      2012.0         6.3
4915  My Date ...      2004.0         6.6

[4916 rows x 3 columns]

In [29]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]
  .sort_values('title_year', ascending=False)                       # sort_values를 이용해서 title_year를 기준 내림차순으로 정렬한다
)                                                                    # sort_values의 기본값은 오름차순(True)

      movie_title  title_year  imdb_score
3884     The Veil      2016.0         4.7
2375  My Big F...      2016.0         6.1
2794  Miracles...      2016.0         6.8
92    Independ...      2016.0         5.5
153   Kung Fu ...      2016.0         7.2
...           ...         ...         ...
4683       Heroes         NaN         7.7
4688  Home Movies         NaN         8.2
4704   Revolution         NaN         6.7
4752  Happy Va...         NaN         8.5
4912  The Foll...         NaN         7.5

[4916 rows x 3 columns]

In [30]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]                      # 연도와 점수를 동시에 정렬
  .sort_values(['title_year','imdb_score'],                          # title_year의 내림차순 정렬에 imdb_score의 내림차순 정렬을 한다
               ascending=False)
)

      movie_title  title_year  imdb_score
4312  Kickboxe...      2016.0         9.1
4277  A Beginn...      2016.0         8.7
3798      Airlift      2016.0         8.5
27    Captain ...      2016.0         8.2
98    Godzilla...      2016.0         8.2
...           ...         ...         ...
1391    Rush Hour         NaN         5.8
4031     Creature         NaN         5.0
2165  Meet the...         NaN         3.5
3246  The Bold...         NaN         3.5
2119  The Bach...         NaN         2.9

[4916 rows x 3 columns]

In [31]:
(movie
  [['movie_title', 'title_year', 'imdb_score']]
  .sort_values(['title_year','imdb_score'],                    # title_year의 내림차순 정렬에 imdb_score의 내림차순 정렬을 한다
               ascending=False)                               # drop_duplicates - 첫 행만 남기고 행삭제는 이루어지지 않는다
  .drop_duplicates(subset='title_year')                        # drop_duplicates 메소드를 이용해 'title_year'기준으로 첫행만 남긴다
)                                                              # 매년 최고 점수의 영화만 추출한다

      movie_title  title_year  imdb_score
4312  Kickboxe...      2016.0         9.1
3745  Running ...      2015.0         8.6
4369  Queen of...      2014.0         8.7
3935  Batman: ...      2013.0         8.4
3     The Dark...      2012.0         8.5
...           ...         ...         ...
2694   Metropolis      1927.0         8.3
4767  The Big ...      1925.0         8.3
4833  Over the...      1920.0         4.8
4695  Intolera...      1916.0         8.0
2725  Towering...         NaN         9.5

[92 rows x 3 columns]

### How it works...

## There's more...

In [32]:
(movie                                               # groupby 메소드 사용
  [['movie_title', 'title_year', 'imdb_score']]      # groupby를 사용하면 기본으로 그룹 라벨이 index가 된다.
  .groupby('title_year', as_index=False)            # index를 사용하고 싶은 않은 경우에는 as_index=False 를 설정
  .apply(lambda df: df.sort_values('imdb_score',    # apply 이용해서 sort_values로 'imdb_score'의 기준을 내림차순으로 정렬하고 
         ascending=False).head(1))                  # head를 이용해 위의 1개만 출력
  .sort_values('title_year', ascending=False)       # 그리고 title_year기준 내림차순으로 정렬
)

         movie_title  title_year  imdb_score
90 4312  Kickboxe...      2016.0         9.1
89 3745  Running ...      2015.0         8.6
88 4369  Queen of...      2014.0         8.7
87 3935  Batman: ...      2013.0         8.4
86 3     The Dark...      2012.0         8.5
...              ...         ...         ...
4  4555  Pandora'...      1929.0         8.0
3  2694   Metropolis      1927.0         8.3
2  4767  The Big ...      1925.0         8.3
1  4833  Over the...      1920.0         4.8
0  4695  Intolera...      1916.0         8.0

[91 rows x 3 columns]

In [33]:
(movie
  [['movie_title', 'title_year',                     # 한열을 오름차순으로 정렬하면서 동시에 다른열을 내림차순으로 정렬하기
    'content_rating', 'budget']]
   .sort_values(['title_year',                       # sort_values를 이용해 'title_year','content_rating','budget' 기준으로
       'content_rating', 'budget'],                  # 'title_year' 내림차순으로 정렬하고 그 값에서 content_rating'의 내림차순으로 정렬하고
       ascending=[False, False, True])             # 'budget'기준은 오름차순으로 정렬한다
   .drop_duplicates(subset=['title_year',            # 'title_year','content_rating'의 첫 행만 유지한다?
        'content_rating'])                      
)

      movie_title  title_year content_rating      budget
4026    Compadres      2016.0            R     3000000.0
4658  Fight to...      2016.0        PG-13      150000.0
4661   Rodeo Girl      2016.0           PG      500000.0
3252  The Wailing      2016.0    Not Rated           NaN
4659  Alleluia...      2016.0          NaN      500000.0
...           ...         ...          ...           ...
2558   Lilyhammer         NaN        TV-MA    34000000.0
807   Sabrina,...         NaN         TV-G     3000000.0
848   Stargate...         NaN        TV-14     1400000.0
2436       Carlos         NaN    Not Rated           NaN
2119  The Bach...         NaN          NaN     3000000.0

[359 rows x 4 columns]

* .drop_duplicates은 기본적으로 첫번째 항목만 유지하지만 keep='last'를 사용하면 마지막 행을 선택하고,\
   keep = False를 사용하면 모든 중복 항목을 삭제한다

## Replicating nlargest with sort_values

### How to do it...

In [34]:
movie = pd.read_csv('data/movie.csv')
(movie
   [['movie_title', 'imdb_score', 'budget']]  
   .nlargest(100, 'imdb_score')                   # .nlargest 메소드를 이용해 'imdb_score'기준 상위 100개까지 출력하고
   .nsmallest(5, 'budget')                        # .nsmallest 메소드로 'budget' 하위 5개 출력
)

      movie_title  imdb_score    budget
4804  Butterfl...         8.7  180000.0
4801  Children...         8.5  180000.0
4706  12 Angry...         8.9  350000.0
4550  A Separa...         8.4  500000.0
4636  The Othe...         8.4  500000.0

In [35]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .sort_values('imdb_score', ascending=False)   # 'imdb_score' 기준으로 내림차순 정렬하고
   .head(100)                                     # head로 100개를 뽑는다
)

      movie_title  imdb_score      budget
2725  Towering...         9.5         NaN
1920  The Shaw...         9.3  25000000.0
3402  The Godf...         9.2   6000000.0
2779      Dekalog         9.1         NaN
4312  Kickboxe...         9.1  17000000.0
...           ...         ...         ...
3799  Anne of ...         8.4         NaN
3777  Requiem ...         8.4   4500000.0
3935  Batman: ...         8.4   3500000.0
4636  The Othe...         8.4    500000.0
2455       Aliens         8.4  18500000.0

[100 rows x 3 columns]

In [36]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .sort_values('imdb_score', ascending=False)   # 'imdb_score' 기준으로 내림차순 정렬하고
   .head(100)                                     # head로 100개를 뽑는다
   .sort_values('budget')                         # ''budget' 기준으로 오름차순 정렬하고
   .head(5)                                       # head로 5개를 뽑는다
)

      movie_title  imdb_score    budget
4815  A Charli...         8.4  150000.0
4801  Children...         8.5  180000.0
4804  Butterfl...         8.7  180000.0
4706  12 Angry...         8.9  350000.0
4636  The Othe...         8.4  500000.0

### How it works...

In [37]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .nlargest(100, 'imdb_score')                   # .nlargest 메소드로 'imdb_score'기준 100개를 뽑아
   .tail()                                        # 끝부분만 출력한다
)

      movie_title  imdb_score     budget
4023       Oldboy         8.4  3000000.0
4163  To Kill ...         8.4  2000000.0
4395  Reservoi...         8.4  1200000.0
4550  A Separa...         8.4   500000.0
4636  The Othe...         8.4   500000.0

In [38]:
(movie
   [['movie_title', 'imdb_score', 'budget']]
   .sort_values('imdb_score', ascending=False)      # .sort_values 메소드로 'imdb_score'를 내림차순으로 정렬하고 
   .head(100)                                       # 상위 100개를 뽑아
   .tail()                                          # 끝부분만 출력한다?
)

      movie_title  imdb_score      budget
3799  Anne of ...         8.4         NaN
3777  Requiem ...         8.4   4500000.0
3935  Batman: ...         8.4   3500000.0
4636  The Othe...         8.4    500000.0
2455       Aliens         8.4  18500000.0

## Calculating a trailing stop order price

### How to do it...

* 추적 지정가 주문 : 주식이 상승하면 지정가가 올라간다 예) 100달러에 구매한 주식이 120달로 상승하면 지정가가 108 달러로 상승
                     지정 가격 변동은 상승 경우에만 발생 하락할땐 변동이 안된다
                     
* 주식시장가격 읽어오는 패키지 필요 / 콘솔창에 conda install pandas-datareader 또는 pip install pandas-datareader 실행

In [39]:
import datetime                                    # datetime 모듈을 불러오기
import pandas_datareader.data as web               # 웹 판다스 리더 모듈 불러오기
import requests_cache                              # requests_cache 모듈 불러오기
session = requests_cache.CachedSession(
   cache_name='cache', backend='sqlite', 
   expire_after=datetime.timedelta(days=90))

ModuleNotFoundError: No module named 'requests_cache'

In [ ]:
tsla = web.DataReader('tsla', data_source='yahoo',              # 야후에서 2017년 첫 거래일부터 테슬라 가격을 불러온다
   start='2017-1-1', session=session)
tsla.head(8)

In [ ]:
tsla_close = tsla['Close']                                     # 종가를 기준으로 잡는다

In [ ]:
tsla_cummax = tsla_close.cummax()                              # .cummax()메소드를 이용해 현재까지의 종가 중 최고가를 추적
tsla_cummax.head()                                             # .cummax()메소드는 현재 값을 포함한 최댓값을 유지한다

In [ ]:
(tsla
  ['Close']                                                    # 테슬라 종가에 최고가에 0.9를 곱하여 상위 5개만 나타냄
  .cummax()
  .mul(.9)
  .head()
)

### How it works...

### There's more...